In [0]:
import pandas as pd

In [0]:
df=pd.read_csv("com.csv")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [8]:
df.head()

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100
3    Little John        Foo  Robin Hood     100
4  Sam Allardyce        NaN         NaN     250

In [9]:
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [10]:
df.tail()

            Name Department      Manager  Salary
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [11]:
df.shape

(6, 4)

In [12]:
df['Name']

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [15]:
df[['Name','Salary']]

            Name  Salary
0     Robin Hood     200
1  Arsene Wenger      50
2     Friar Tuck     100
3    Little John     100
4  Sam Allardyce     250
5  Dimi Berbatov      50

In [16]:
df.iloc[0]

Name          Robin Hood
Department           NaN
Manager              NaN
Salary               200
Name: 0, dtype: object

In [17]:
df.iloc[0:,0]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [19]:
df.iloc[0:,0:2]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [20]:
df.iloc[0:,[0,3]]

            Name  Salary
0     Robin Hood     200
1  Arsene Wenger      50
2     Friar Tuck     100
3    Little John     100
4  Sam Allardyce     250
5  Dimi Berbatov      50

In [0]:
df1=pd.read_csv("bank.csv")

In [23]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
RowNumber          10000 non-null int64
CustomerId         10000 non-null int64
Surname            10000 non-null object
CreditScore        10000 non-null int64
Geography          10000 non-null object
Gender             10000 non-null object
Age                10000 non-null int64
Tenure             10000 non-null int64
Balance            10000 non-null float64
NumOfProducts      10000 non-null int64
HasCrCard          10000 non-null int64
IsActiveMember     10000 non-null int64
EstimatedSalary    10000 non-null float64
Exited             10000 non-null int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [24]:
df1.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [25]:
df1.shape

(10000, 14)

In [26]:
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [28]:
df['Salary'].max()

250

In [29]:
df['Salary'].min()

50

In [30]:
df['Salary'].mean()

125.0

In [31]:
df['Salary'].sum()

750

In [32]:
df['Salary'].count()

6